#################################################################################
def divide_nuts(x, y):
    whole_nuts = y // x
    nuts_left = y % x

    print(f"Кожна білка отримає {whole_nuts} цілих горіхів.")
    print(f"Залишиться {nuts_left} горіхів.")

x = int(input("Введіть кількість білок (x): "))
y = int(input("Введіть кількість горіхів (y): "))
divide_nuts(x, y)

#################################################################################

def calculate_total_posts(x, y, z, n):
    total_posts = x + y + (z * (n - 2))
    return total_posts

x = int(input("Введіть кількість дописів, зроблених Петром: "))
y = int(input("Введіть кількість дописів, зроблених Марічкою: "))
z = int(input("Введіть кількість дописів, зроблених кожним учнем: "))
n = int(input("Введіть загальну кількість студентів:"))

total_posts = calculate_total_posts(x, y, z, n)

print(f"Загальна кількість дописів, зроблених усіма студентами: {total_posts}")
#################################################################################