# Цей рядок коду запитує користувача, скільки піци він хоче замовити, і зберігає відповідь користувача як ціле число в змінній num_pizzas.
num_pizzas = int(input("Скільки піц замовляєте? "))

# Цей рядок коду запитує у користувача ціну кожної піци та зберігає відповідь користувача як число з рухомою комою в змінній pizza_price.
pizza_price = float(input("Скільки коштує одна піца? "))

# Цей рядок коду обчислює загальну ціну покупки шляхом множення кількості піц на ціну кожної піци та збереження результату в змінній total_price.
total_price = num_pizzas * pizza_price

# Цей рядок коду застосовує знижку 10% до загальної ціни покупки шляхом множення загальної ціни на 0,9 і збереження результату в змінній discounted_price.
discounted_price = total_price * 0.9

# Цей рядок рахує зекономлені гроші шляхом віднімання ціни без знижки (total_price) та ціни зі знижкою (discounted_price), та зберігає результат у змінну savings
savings = total_price - discounted_price

# Цей рядок відображає загальну ціну покупки для користувача за допомогою f-рядка. :.2f у f-рядку форматує ціну зі знижкою як число з плаваючою точкою з двома знаками після коми.
print(f"Ціна без знижки {total_price:.2f}.")
print(f"Знижка {savings:.2f}")
print(f"Ціна зі знижкою {discounted_price:.2f}.")